public class Tasck30 {
    String result = "https://github.com/SergeyHodak/Tascks-hw-6-SergeyHodak";
}

/*
Задача - залить код на github
    Создай новый публичный github репозиторий, в названии которого есть текст hw-6.
    Добавь в корень репозитория файл uid.txt с твоим личным идентификатором (узнать его можно, написав боту слово uid).
    Также добавь в корень репозитория файл NameParserTest.java, в котором будет исходный код решения предыдущей задачи.
    Отправь ссылку на репозиторий в редактор java-кода и нажми на кнопку "Проверить".
 */